Repository: giellalt/corpus-nob
Catalog: prestable/tmx/goldstandard/sme/facta/skuvlahistorja4/kirsten-n.htm.tmx
Source language: nob
Languages: sme

source: Rektor Beyer kom inn i timen , så på meg og spurte : Er du fra Kautokeino ?
sme: Rektor Beyer bođii diibmui , geahčastii munnje ja dajai : – Leat go don guovdageaidnulaš ?

source: Jeg nikket .
sme: Mun nivkalin .

source: Jeg hadde oppfattet ordet Kautokeino .
sme: Ipmirdin sáni « Kautokeino » .

source: Så kom han bort til meg , tok meg i handa og sa « god dag » .
sme: De son bođii mu lusa , dollii mu gihtii ja dajai « god dag » .

source: Jeg reiste meg , tok han i hånden og neide pent .
sme: Mun čuoččahin , dollejin su gihtii ja nejjestin čábbát .

source: Så sa han ; « Du må tegne en rein » .
sme: De son dajai : « Galggat dennjet et bohcco . »

source: Jeg skjønte ikke hvorfor , men jeg begynte å tegne .
sme: In ipmirdan manne , muhto álgen sárgut bohcco .

source: Han så på tegningen og nikket .
sme: Son geahčai govvii ja nivkalii .

source: De andre hadde også fått tegneoppgaver .
sme: Eará oahppit ožžo maiddái dennjenbarggu .

source: Deretter ble vi delt inn i grupper .
sme: De mii juhkkojuvvuimet moatti jovkui .

source: Jeg kom i B-klassen .
sme: Mun šadden B-klássii .

source: Noen kom i A . På den måten nivå-delte de klassene .
sme: Muhtumat besse A-klássii . Nu sii juhke ohppiid guhtege máhtolašvuođa mielde .

source: Da gikk vi i gata slik at hun kunne vise meg frem og så på besøk til noen .
sme: Moai vácciime gáhta mielde , son čájáhalai mu olbmuide , ja de manaime oahppaladdat muhtun olbmuid .

source: Det kunne bli sene kvelder og jeg var ofte trøtt og sliten når vi kom tilbake .
sme: Muhtumin lei juo maŋŋit eahket go vulggiime , ledjen váiban hirbmadit go bođiime fas ruovttoluotta .

source: Neste morgen var jeg trøtt på skolen .
sme: Nuppe beaivvi ledjen váibbas skuvllas .

source: Dette varte helt til jeg kom i 3. eller 4. klasse .
sme: Nu lei dassážii go ollejin 3. dehe 4. klássii .

source: Da krigen var over , kunne alle elevene reiste hjem .
sme: Oainnát go soahti nogai , de besse buot oahppit vuolgit ruoktot .

source: Jeg reiste til Kvænangen og mor og far kom og hentet meg .
sme: Mun mannen Návutnii , ja áhčči ja eadni vieččaiga mu .

source: Der sa jeg til mor at jeg ikke ville ha samiske klær på skolen .
sme: Dadjen eadnásan ahte in fuola šat sámi biktasiid skuvlii .

source: Jeg ville hun skulle gjemme dem hjemme . Eller gi dem til Ellen , min slektning .
sme: Sihten su čiehkat daid biktasiid eret , dehe addit daid Ellii , mu fuolkái .

source: Jeg var så lei av at husmor og andre lærere tok meg med ut på kaffebesøk for å vise meg fram .
sme: Ledjen nu gallánan dasa go dálueamit ja earát dolvo mu olbmuid lusa gáfeguossái čájáhussan .

source: Jeg ville jo leke med barna på døveskolen .
sme: Mun goit háliidin stoahkat mánáiguin bealjehemiid skuvllas .

source: Det var et slit å bli vist frem på det viset . Men det siste sa jeg ikke til mor .
sme: Lávejin jur nu váibat go šadden dakkár čájáhussan , muhto dan gal in muitalan eadnásan .

source: Så da høsten kom og jeg var tilbake på døveskolen spurte husmor etter mine sameklær .
sme: Go de šattai fas čakča ja bohten fas bealjehemiid skuvlii , de jearai dálueamit mu sámi biktasiid .

source: Hun sa jeg var dum som hadde lagt dem igjen hjemme .
sme: Son logai mu jallan go ledjen guođđán daid ruoktot .

source: Jeg svarte ikke .
sme: In vástidan .

source: Jeg orket ikke .
sme: In nagodan šat .

source: Rektor mente også at jeg skulle ha tatt med meg sameklærne .
sme: Rektora mielas maiddái livččen galgan váldit mielde sámi biktasiiddan .

source: Tenk at jeg måtte være med dem hver lørdag .
sme: Jurddaš go šadden vuolgit sin mielde juohke lávvordaga .

source: Jeg var så lei .
sme: Ledjen nu váivahuvvan .

source: Men de andre elevene var sjalu på meg .
sme: Eará oahppit gal gáđaštedje mu .

source: De så bare at jeg fikk være med på besøk hver lørdag og spise kaker og annet godt .
sme: Sii oidne ahte dušše mun dat bessen vuolgit olbmuid guossái juohke lávvordaga , bessen borrat gáhkuid ja eará njálgáid .

source: De syntes jeg var en « tigger » .
sme: Sin mielas ledjen mun « ánuheaddji » .

source: Derfor ga jeg blaffen i alt det samiske .
sme: Danne mun in šat beroštan mastege sámis .

source: Dessverre fikk jeg ikke tilbake mine samiske klær fra husmor . De jeg hadde når jeg kom .
sme: Dađibahábut in ožžon šat dálueamidis sámebiktasiiddan , daid mat mus ledje go dalle go bohten dohko .

source: De ble borte .
sme: Dat gal jávke áibbas .

source: Det har smertet meg .
sme: Munnje lea dat leamaš bávččasin .

source: Min mor spurte etter klærne da jeg kom hjem og jeg kunne ikke svare .
sme: Eadnán jearai mus sámi biktasiid go máhccen fas ruoktot . In diehtán vástidit .

source: Det var flaut .
sme: Heahpanin .

source: Jeg vet at husmor gjemte på dem på loftet på skolen fordi det var så mange elever som ville prøve klærne mine .
sme: Dieđán ahte internáhta dálueamit dat čiegai daid loktii vai eará mánát eai vikka geahččaladdat daid .

source: Men de kom aldri til rette igjen .
sme: Eai biktasat gal dihton dađi eanet .

source: Da jeg kom til skolen første gang ble jeg forresten kledd opp og tatt med til fotograf .
sme: Go bohten skuvlii vuohččan , de gárvvuhedje mu ja dolvo mu govvejeaddji lusa .

source: Det ble skrevet i avisen meg .
sme: Čálle aviisii mu birra .

source: Det var visst en begivenhet at det kom ei samejente til skolen kledd i kofte .
sme: Lei vissa erenoamáš dáhpáhus go sámi nieiddaš bođii skuvlii sámegávttiin .

source: Jeg fikk det bildet noen år senere .
sme: Ožžon dan gova muhtun jagiid maŋŋil .

source: Jeg visste ikke da at det hadde vært i avisen .
sme: In dalle diehtán ahte dat lei leamaš aviissas .

source: Men det var lite prat om samer på døveskolen .
sme: Eai bealjehemiid skuvllas hupman nu ollu sápmelaččaid birra .

source: Likevel opplevde jeg ikke at det å være same som vanskelig . Heller ikke at det var vanskelig å tilpasse seg en norsk kultur .
sme: Ii dan dihte lean gal mu mielas váttis doppe sápmelažžii , dehe heivehit iežas dáru kultuvrii .

source: Det var bare ikke et tema .
sme: Dat ášši ii lean sáhkan doppe .

source: Ble jeg spurt om jeg var same sa jeg alltid ja .
sme: Jos mus jerre lean go sápmelaš , de dadjan álo ahte lean .

source: Mer var det ikke med det .
sme: Ii das lean šat dađi eanet .

source: Det eneste som var vanskelig var alle disse besøkene .
sme: Áidna mii lei váttis , lei go šadden buot daid olbmuid lusa guossái .

source: Jeg ville helst leke med andre barn .
sme: Háliidin stoahkat earáiguin .

source: Jeg ble jo bare kvalm av kakene og kaffen og så måtte jeg takke pent og spise .
sme: Buot dat gáhkut ja gáffe lei jur vuovssihahtti , ja fertejin giitit čábbát ja borrat .

source: De voksne hadde det hyggelig , men ikke jeg .
sme: Ollesolbmuide lei dat suohtas , muhto ii mu mielas gal .

source: Ikke skjønte jeg hva de pratet om , for det gikk over hodet på meg .
sme: In ge mun ipmirdan maid sii hupme , sánit manne mu guora .

source: Og bare det å komme sent hjem , etter at alle hadde lagt seg , trøtt og sliten , kle av seg og komme seg i seng .
sme: Ja lei ges dat ahte ollet ruoktot maŋŋiteahket , maŋŋel go buohkat ledje nohkkan , ledjen váibbas , ja de nuoladit ja velledit seŋgii .

source: Av og til kunne klokka bli både tolv og ett før vi var tilbake til skolen .
sme: Muhtumin lávii diibmu guoktenuppelohkái dehe okta ihkku go máhcaimet fas skuvlii .

source: Men det å være samisk hadde jeg ingen problemer med .
sme: Iešalddis dat go ledjen sápmelaš gal ii daguhan makkárge váttisvuođaid .

source: Tale og artikulasjon , ikke tegnspråk
sme: Hupmat čielgasit , ii giehtagiela atnit

source: På skolen var det mest tale og artikulasjon i timene .
sme: Skuvllas lei eanas aivve hupman ja artikulašuvdna ( čielgasit-cealkin ) diimmuin .

source: Der var det ikke lov å bruke tegnspråk .
sme: Doppe ii lean lohpi atnit giehtagiela .

source: Det var viktig at vi lærte å uttale lydene og lære ord , norsk selvfølgelig .
sme: Lei dehálaš oahppat cealkit jienaid ja oahppat sániid , dárogillii dieđusge .

source: Men jeg lærte fort .
sme: Mun dat gal ohppen jođánit .

source: Vi hadde også andre fag , som for eksempel regning .
sme: Mis ledje eará fágat , omd. rehkenastin .

source: Jeg var ikke så flink der .
sme: Das in gal lean nu čeahppi .

source: Vi hadde ikke tegnspråk i timene .
sme: Ii mis lean giehtagiella skuvladiimmuin .

source: Brukte vi tegnspråk der inne fikk vi et rapp over fingrene med pekestokken .
sme: Jos doppe mettiimet atnit giehtagiela , de dearpaledje sii min suorpmaide cuoigunsoppiin .

source: Vi prøvde likevel i smug , men læreren oppdaget det fort .
sme: Vikkaimet gal suoli atnit giehtagiela , muhto oahpaheaddji oinnii min dakkaviđe .

source: Det var kun på fritiden vi brukte tegnspråk oss elever imellom .
sme: Dušše friddjaáiggis mii oahppit aniimet giehtagiela gaskaneamet .

source: De yngste lærte av de eldre .
sme: Nuorabut ohppe boarráseappuin .

source: Det var jo først mye senere at det ble brukt tegnspråk i undervisningen på døveskolen .
sme: Easka arvat maŋŋil álge atnit giehtagiela bealjehemiid skuvlla oahpahusas .

source: Lærerne og de ansatte på skolen håndhevet reglene på skolen flittig . De var strenge , men likevel var de snille .
sme: Oahpaheaddjit ja skuvlla bargit muđui doalahedje hui áŋgirit skuvlla njuolggadusaid , ledje garrasat , muhto goitge siivvut .

source: Vel , det var vel kanskje litt forskjellig det også da.
sme: Na , gal soittii gal dat nai nuo ja ná .

source: Vi ble veldig passet på i forhold til hvordan vi kledde oss .
sme: Sii bearráigehčče hui dárkilit dan mot mii gárvodeimmet .

source: De skulle ikke ha syke barn og vi skulle være pent kledd .
sme: Eai sis galgan buohcci mánát , ja mii galggaimet gárvodit čábbát .

source: Der var det ikke rom for slurv .
sme: Šlurváivuohta gal ii dohkkehuvvon .

source: Hvis jeg gikk ut uten kåpe ble jeg sendt fort inn for å ta den på .
sme: Jos mannen olggos kovppa haga , de gal gevrejedje mu fas vissui coggat dan badjelasan .

source: Vi gikk i kjoler og støvletter og først når mai kom kunne vi få lov til å ta lette sko på oss .
sme: Mii vácciimet čuvllaiguin ja dálveskuovaiguin , ja easka miessemánus beasaimet coggat geasseskuovaid .

source: Men i september var det tilbake med støvlettene .
sme: Čakčamánus lei fas bággu coggat dálveskuovaid .

source: De hadde stålkant og når alle elevene løp i gangene så kunne jeg høre at det klapret .
sme: Dálveskuovain ledje stállerávddat ja go buot oahppit vihke feaskáriin , de sáhtten gullat ahte čolkkii .

source: Jeg hørte nok ikke så mye , men jeg var ikke vant til lyder .
sme: In mun gal gullan nu ollu , muhto in lean hárjánan jienaide .

source: Det var så stille på fjellet så jeg opplevde det som bråk .
sme: Meahcis lei nu jaskat ahte vásihin dan jiena riedjan .

source: Jeg hadde bare så vidt hørt hundeglam og flydur tidligere .
sme: Ledjen dušše gullan beatnagiid šáikasa ja girdiid jurrama ovdal .

source: Det var en ny opplevelse .
sme: Dat lei ođđa vásáhus munnje .

source: Støvlettene var også vonde å gå med .
sme: Dálveskuovat godde maiddái julggiid váccidettiin .

source: Men slik var det .
sme: Na nu hal dat nai lei .

source: Dagen startet kl. 7 med frokost og så var det å være på skolen hele dagen .
sme: Skuvlabeaivi álggii diibmu 7:s iđitborramušain , ja de galggaimet skuvllas beaivvi miehtá .

source: Det var ikke lekser , men egen lesetime fra 15 til 16 hver dag .
sme: Eai lean gal leavssut , muhto sierra leaksolohkandiibmu diibmu golmmas gitta diibmu njealji rádjái juohke beaivvi .

source: Så var det middag og kl. 17 var det håndarbeide .
sme: De lei gaskabeaiborramuš , ja diibmu 17:s ges goarrun ja duddjon .

source: Vi hadde timeplan hele dagen frem til kveldmaten kl. 19 , som var grøt .
sme: Mis lei diibmoplána olles beaivái gitta eahketborranáigái , diibmu 19:s , de gaccaimet buvrru .

source: Leggetid var klokken 20 .
sme: Nohkkanáigi lei diibmu 20:s .

source: Det var ikke mye fritid .
sme: Ii lean gal ollu friddjaáigi .

source: Vi ble beskjeftiget hele dagen , også lørdag .
sme: Min ájihedje vel lávvordaga nai beaivvi miehtá .

source: Da var det aktivitet som ski eller vi fikk også av og til dra på kino .
sme: Dalle čuoiggaimet ja muhtumin beasaimet geahččat ealligovaid .

source: Søndag var fri , med unntak av at vi måtte på gudstjeneste .
sme: Sotnabeaivvi gal lei friddja earret de go galggaimet ipmilbálvalussii girkui .

source: Slik var det på døveskolen .
sme: Nu lei dilli bealjehemiid skuvllas .

source: Men det tok tid før jeg skjønte hvorfor jeg skulle på skolen .
sme: Goitge golai áigi ovdal go ipmirdin manne mun šadden dan skuvlii .

source: Det som jeg skjønte etter hvert var at det var viktig å lese , skrive og prate for så å bli konfirmert .
sme: Dan gal ipmirdin fargga ahte lei dehálaš lohkat , čállit ja hupmat ja de konfirmerejuvvot .

source: Jeg var vel godt opp i tredje eller fjerde klasse før det demret for meg .
sme: Ledjen bures juo ollen goalmmát dehe njealját skuvlajahkái go dan fuomášin .

source: En annen ting var at jeg heller ikke kan huske at jeg forsto at krigen var vanskelig for folk .
sme: Nubbi eará ášši lea go in ipmirdan ahte soahti lei váttis dilli olbmuide .

source: Jeg hadde møtt tyske soldater på båten og de var snille .
sme: Ledjen oaidnán duiskka soalddáhiid fatnasis , ja sii ledje siivvut .

source: De hadde til og med gitt meg penger og sjokolade .
sme: Ledje addán munnje vel ruđa ja šukuláde nai .

source: Det ble pratet mye blant elevene om Hitler og nazismen og at det fulgte tvang og død med dem.
sme: Oahppit hupme ollu Hitlera ja nazismma birra , go dat daguhedje bákku ja jápmima .

source: Det var først da jeg så ødeleggelsene at jeg forsto hva de snakket om .
sme: Go oidnen billistemiid , de ipmirdin man birra sii hupme .

source: Men når vi døve elever gikk i byen og brukte tegnspråk kom det av og til soldater til oss med godteri .
sme: Go mii bealjehis mánát vácciimet gávpogis , de dávjá soalddáhat adde midjiide njálgáid .

source: Jeg visste ikke ha vi skulle mene .
sme: In diehtán maid galggaimet oaivvildit dasa .

source: Så tanker og forståelse for hva som skjedde i samfunnet fikk jeg gjennom samtaler med elever .
sme: Ipmárdusamet servodaga birra oaččuimet dain eará ohppiin .

source: På skolen lærte jeg først og fremst å lese , skrive og regne .
sme: Skuvllas ohppen ovddemusta lohkat , čállit ja rehkenastit .

source: Oppveksten på døveskolen hadde sine sider den også .
sme: Gal bajásšaddamis bealjehemiid skuvllas ledje nai eará bealit .

source: De som hadde rike foreldre fikk klær hjemmefra og de som ikke var så godt bemidlet fikk fra skolen .
sme: Rikkis olbmuid mánát ožžo biktasiid ruovttus , ja hejotbirgejeaddji mánát ožžo daid skuvllas .

source: Vi jentene gikk alle med ullkjoler og forklær .
sme: Mii nieiddažat buohkat gárvodeimmet ulločuvllaiguin ja firkaliiguin .

source: Guttene hadde vadmelsbukser og skjorte .
sme: Bártnážiin ledje gákkesbuvssat ja báidi .

source: Ullklærne klødde noe forferdelig og vi klorte oss til blods .
sme: Ullobiktasiiguin satnjidii liikki issorasat ja mii ruohkaimet iežamet varaide .

source: Vi manglet ikke mat , men det var mye sur mat. Vi spiste av stålkopper , som rustet og ga dårlig smak .
sme: Borramuš mis gal ii váilon , muhto lei gal ollu suvron borramuš man boraimet stállelihtiin . Ja gohput ledje ruostasat , dat báidne borramuša .

source: Grøten var ofte full av klumper , men vi måtte spise og det var likt for alle .
sme: Buvrrus ledje dávjá ollu čoalttut , muhto fertiimet gazzat dan , buohkaide seamma dilli .

source: Savnet etter familien var tungt , men jeg var i et miljø hvor jeg forsto og hadde venner .
sme: Ohcalin iežamet joavkku issorasat , muhto ledjen goit dakkáriid searvvis geat ipmirdedje , ja mus ledje ustibat .

source: Utskrift av Kautokeino skolestyres møtebok for 15/3-1947
sme: Sierračálus Guovdageainnu skuvlastivrra beavdegirjjis 15/3-1947

source: Ref av skriv fra fylkesmannen i Finnmark av 29/1 , samt eksamensvitnesbyrd for 1946 for Risten Sara , elev ved Trondheim off. skole for døve .
sme: Finnmárkku fylkkamánni čállosa ref. 29/1 , ja bealjehemiid almmolaš skuvlla oahppi Troandimis Risten Sara 1946 eksámenduođaštus .

source: Husmorskolen for døve
sme: Bealjehemiid dálueamitskuvla

source: – Etter at jeg var ferdig på døveskolen gikk jeg på husmorskole for døve i Stavanger .
sme: – Maŋŋel go gergen bealjehemiid skuvllas , de vázzen bealjehemiid dálueamitskuvlla Stavangeris .

source: Jeg gikk der i to år .
sme: Vázzen doppe guokte jagi .

source: Man skulle jo lære å lage mat , stelle hus , sy og veve .
sme: Doppe olmmoš galggai oahppat ráhkadit borramuša , čorget viesu , goarrut ja čuoldit .

source: Jeg gikk der først et år , men de mente det var for lite , så jeg måtte gå et år til .
sme: Álggos vázzen doppe jagi , muhto sii oaivvildedje ahte mun ferten vázzit vel jagi doppe .

source: Det var skolen i Stavanger som anbefalte det , sammen med døvepresten .
sme: Stavanger skuvla ja bealjehemiid báhppa dat ávžžuhedje mu joatkit .

source: Jeg hadde lyst på vevlinjen på en skole for døve i Hamar .
sme: Mus lei miella vázzit čuoldinsuorggi bealjehemiid skuvllas Hamaris .

source: Presten syntes ikke om det , så det ble et år til i Stavanger .
sme: Báhppa ii lean mielas dasa , ja nu šadden Stavangerii vel jagi .

source: Jeg syntes ikke skolen i Stavanger var god .
sme: Ii mu mielas lean Stavangera skuvla nu buorre .

source: Jeg mente at jeg kunne lære mer i Hamar , men man føyde seg etter presten .
sme: Oaivvildin mun oahpašin eanet Hamaris , muhto olmmoš jeagadii dieđusge báhpa .

source: En bra ting med skolen i Stavanger var likevel at vi lærte å svømme .
sme: Buorre bealli Stavangera skuvllas lei dattege ahte mun ohppen vuodjat doppe .

source: Det var ikke så mange valgmuligheter for døve den gang .
sme: Eai dalle lean nu galle dakkár vejolašvuođa bealjehemiide .

source: Da jeg var ferdig i Stavanger jobbet jeg som syerske i Ålesund , men ville hjem og dro til Kautokeino .
sme: Go gergen Stavangeris , de bargen goarrun Ålesundas , muhto háliidin ruoktot ja vulgen Guovdageidnui .

source: Der fikk jeg jobb som hushjelp .
sme: Doppe ožžon barggu biigán .

source: Jeg skulle stelle både i huset og fjøset hos en familie .
sme: Galgen bargat sihke náveha ja viessobarggu muhtun joavkku luhtte .

source: Der sluttet jeg etter et år og ble hjemme .
sme: Das luhpen go ledjen biigon jagi ja báhcen ruoktot .

source: Jeg husker far spurte en gang om jeg ville være i reindrifta .
sme: Muittán áhči go jearai háliidivččen go bargat bohccuiguin .

source: Jeg hadde mistet det samiske språket og det var vanskelig å kommunisere med familien .
sme: Ledjen vajálduhttán sámegiela in ge báljo gulahallan iežamet olbmuiguin .

source: Jeg hadde sterke bånd , men ikke felles språk .
sme: Mis lei ollu oktasašvuohta , muhto ii oktasaš giella .

source: Det måtte bli norsk .
sme: Fertejin dárostit .

source: Så jeg dro til Oslo og begynte å jobbe på en lampefabrikk .
sme: Ja nu mun vulgen Osloi ja bargagohten lámpáfabrihkas .

source: Jeg hadde venner blant døve .
sme: Bealjeheamit dat ledje mu ustibat .

source: Same uten samisk
sme: Sápmelaš sámegiela haga

source: I dag er det slik at jeg føler meg samisk , ikke norsk , men jeg kan ikke språket .
sme: Dál lea nu ahte lean iežan mielas sápmelaš , in rivgu , muhto in máhte gal giela .

source: Jeg bruker norsk .
sme: Dárostan .

source: Jeg ble skolert vekk fra min kultur , men husk at det var nødvendig .
sme: Oahpahuvvojin iežan kultuvrras eret , muhto fertet muitit ahte nu lei dárbu .

source: Kautokeino hadde ikke kunnskap eller tilbud til døve elever .
sme: Guovdageainnus ii lean máhtolašvuohta eai ge fálaldagat bealjehis ohppiide .

source: Alternativet hadde vært å ikke få skolegang i det hele tatt .
sme: Molssaeaktun dasa livččii ahte in lean obage beassat vázzit skuvlla .

source: Hva da ?
sme: Mot de ?

source: Det er vondt å ha mistet sitt språk og sin kultur , men jeg fikk et annet som jeg kan kommunisere på .
sme: Lea bávččas go olmmoš lea massán gielas ja kultuvrras , muhto ožžon dan giela sadjái eará giela mainna gulahalan .

source: Jeg har også fått kulturtilhørighet til et døvemiljø .
sme: Mus lea maiddái kultuvrralaš gullevašvuohta bealjehemiid servodahkii .

source: Når jeg møter mine skulle jeg ønske jeg kunne samisk . Men den gang var det ikke snakk om samisk på døveskolen . Og langt i fra at familien kunne lære tegnspråk .
sme: Go dál oaidnalan iežan olbmuiguin , de sávašin máhttit sámegiela , muhto dalle ii lean hupmu ge beassat atnit sámegiela bealjehemiid skuvllas , juobeson vel giehtagiela oahppu min jovkui .

source: Jeg hadde god kontakt med min bror . Etter å ha vært borte lenge og kommet tilbake som voksen , ble det ikke det samme .
sme: Mus lávii lagasvuohta vielljasan , muhto maŋŋel go ledjen jávkan nu guhká , de ii lean šat nu .

source: Vi kjente ikke hverandre .
sme: Ean moai šat dovddadan .

source: Ting endrer seg over år og jeg var veldig skuffet da jeg oppdaget at jeg var en fremmed .
sme: Ollu earáhuvvá áiggi mielde , ja mun beahtahallen sakka go fuomášin ahte lean amasnuvvan .

source: Det var så mye som hadde skjedd på disse årene .
sme: Nu ollu lei dáhpáhuvvan daid vássán jagiid .

source: Jeg har god kontakt med familie , slektninger og venner .
sme: Mus lea buorre oktavuohta joavkkuinan , fulkkiiguin ja oahppásiiguin .

source: De har også vært flinke til å besøke meg i Trøndelag opp gjennom årene .
sme: Sii leat maiddái leamaš viššalat finadit min luhtte Trøndelagas vássán jagiid .

source: Men noe vil alltid mangle : De årene vi ikke hadde sammen .
sme: Goitge váilu juoga álo , dat jagit maid eat beassan vásihit ovttas .

source: Tilknytningen blir sterkere og mer viktig med årene .
sme: Gullevašvuođa dovdu lassána dađistaga ja šaddá hui mávssolažžan .

source: Og nå er også økonomien bedre .
sme: Ja dál lea ruhtadilli maiddái buoret .

source: Jeg kan reise hjem og besøke mine , men jeg kan ikke bo der .
sme: Sáhtán finadit ruovttus iežan olbmuid luhtte , muhto mun in sáhte orrut doppe .

source: Jeg føler meg ofte ensom i min egen kultur .
sme: Lean dávjá hui oktonas iežan kultuvrra dáfus .

source: Men jeg er heldig som har familie som har holdt på kontakten .
sme: Mus lea goitge lihkku , go mus leat iežan olbmot geat leat doalahan oktavuođa muinna .

source: Det må jeg være glad for .
sme: Dan ovddas gal galggan leat ilus .

source: Det er heller ikke enkelt for dem å prate norsk til meg .
sme: Ii sidjiide ge leat álki dárostit muinna .

source: Heldigvis har de også vært flinke til å holde kontakt med mine barn .
sme: Lihkus leat sii nai leamaš hui čeahpit doalahit oktavuođa mu mánáiguin .

source: Jeg er takknemlig for at min mor sendte meg til døveskolen .
sme: Lean giitevaš danne go eadnán sáddii mu bealjehemiid skuvlii .

source: Hun tok en modig avgjørelse .
sme: Dat lei duostilis dahku .

source: Selv om det har kostet meg språket , så ga det meg en skolegang .
sme: Vaikko lean ge massán gielan , de ožžon goit oahpu juobe .

source: [ 1 ] Hjemmet for døve i Andebu i Vestfold blei oppretta 1931 .
sme: [ 1 ] Bealjehemiid ruoktu Andebus Vestfoldas ásahuvvui 1931:s .

source: Det er nå en del av Stiftelsen Signo .
sme: Lea dál oassin ásahusas Stiftelsen Signo .

source: Flere artikler fra Samisk skolehistorie 4
sme: Eará artihkkalat girjjis Sámi skuvlahistorjá 4
